redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_F_OFF_2nd/redis_result_Sequential110_F_OFF_P1_2nd_20230717191248.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        34006.19          ---          ---         2.67013         2.60700         5.27900         5.50300     36436.55 
Gets         3399.27      3399.27         0.00         2.66856         2.60700         5.24700         5.50300      3622.30 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      37405.46      3399.27         0.00         2.66999         2.60700         5.27900         5.50300     40058.85 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.095        0.000
SET       2.415        5.000
SET       2.463       10.000
SET       2.495       15.000
SET       2.511       20.000
SET       2.527       25.000
SET       2.543       30.000
SET       2.559       35.000
SET       2.575       40.000
SET       2.591       45.000
SET       2.607       50.000
SET       2.607       52.500
SET       2.607       55.000
SET       2.623       57.500
SET       2.623       60.000
SET       2.639       62.500
SET       2.639       65.000
SET       2.655       67.500
SET       2.655       70.000
SET       2.671       72.500
SET       2.671       75.000
SET       2.671       76.250
SET       2.687       77.500
SET       2.687       78.750
SET       2.687       80.000
SET       2.703       81.250
SET       2.703       82.500
SET       2.703       83.750
SET       2.719       85.000
SET       2.719       86.250
SET       2.719       87.500
SET       2.735       88.125
SET       2.735       88.750
SET       2.735       89.375
SET       2.735       90.000
SET       2.751       90.625
SET       2.751       91.250
SET       2.751       91.875
SET       2.767       92.500
SET       2.767       93.125
SET       2.783       93.750
SET       2.783       94.062
SET       2.799       94.375
SET       2.799       94.688
SET       2.815       95.000
SET       2.831       95.312
SET       2.847       95.625
SET       2.895       95.938
SET       3.327       96.250
SET       3.535       96.562
SET       4.703       96.875
SET       4.863       97.031
SET       4.927       97.188
SET       4.991       97.344
SET       5.023       97.500
SET       5.055       97.656
SET       5.087       97.812
SET       5.119       97.969
SET       5.119       98.125
SET       5.151       98.281
SET       5.183       98.438
SET       5.183       98.516
SET       5.215       98.594
SET       5.215       98.672
SET       5.215       98.750
SET       5.247       98.828
SET       5.247       98.906
SET       5.279       98.984
SET       5.279       99.062
SET       5.279       99.141
SET       5.311       99.219
SET       5.311       99.258
SET       5.311       99.297
SET       5.343       99.336
SET       5.343       99.375
SET       5.343       99.414
SET       5.343       99.453
SET       5.375       99.492
SET       5.375       99.531
SET       5.375       99.570
SET       5.375       99.609
SET       5.407       99.629
SET       5.407       99.648
SET       5.407       99.668
SET       5.407       99.688
SET       5.407       99.707
SET       5.439       99.727
SET       5.439       99.746
SET       5.439       99.766
SET       5.439       99.785
SET       5.439       99.805
SET       5.471       99.814
SET       5.471       99.824
SET       5.471       99.834
SET       5.471       99.844
SET       5.471       99.854
SET       5.471       99.863
SET       5.471       99.873
SET       5.503       99.883
SET       5.503       99.893
SET       5.503       99.902
SET       5.503       99.907
SET       5.503       99.912
SET       5.503       99.917
SET       5.535       99.922
SET       5.535       99.927
SET       5.535       99.932
SET       5.535       99.937
SET       5.535       99.941
SET       5.567       99.946
SET       5.567       99.951
SET       5.567       99.954
SET       5.567       99.956
SET       5.567       99.958
SET       5.567       99.961
SET       5.599       99.963
SET       5.599       99.966
SET       5.599       99.968
SET       5.599       99.971
SET       5.599       99.973
SET       5.631       99.976
SET       5.631       99.977
SET       5.631       99.978
SET       5.631       99.979
SET       5.631       99.980
SET       5.663       99.982
SET       5.663       99.983
SET       5.695       99.984
SET       5.695       99.985
SET       5.727       99.987
SET       5.759       99.988
SET       5.823       99.988
SET       5.887       99.989
SET       5.983       99.990
SET       6.079       99.990
SET       6.079       99.991
SET       6.175       99.991
SET       6.303       99.992
SET       6.495       99.993
SET       6.655       99.993
SET       6.879       99.994
SET       7.007       99.994
SET       7.167       99.995
SET       7.327       99.995
SET       7.391       99.995
SET       7.455       99.995
SET       7.551       99.996
SET       8.319       99.996
SET       8.447       99.996
SET       8.639       99.997
SET       8.767       99.997
SET       8.831       99.997
SET       8.959       99.997
SET       9.023       99.997
SET       9.215       99.998
SET       9.215       99.998
SET       9.279       99.998
SET       9.599       99.998
SET      10.495       99.998
SET      10.559       99.998
SET      10.623       99.998
SET      10.623       99.999
SET      10.623       99.999
SET      10.687       99.999
SET      10.751       99.999
SET      10.815       99.999
SET      11.007       99.999
SET      11.007       99.999
SET      11.007       99.999
SET      11.071       99.999
SET      11.071       99.999
SET      11.071       99.999
[...]
SET      11.327       99.999
SET      11.327       99.999
SET      11.391       99.999
SET      11.391       99.999
SET      11.391      100.000
SET      11.391      100.000
SET      11.455      100.000
SET      11.455      100.000
SET      11.519      100.000
SET      11.519      100.000
SET      11.519      100.000
[...]
SET      11.647      100.000
SET      11.647      100.000
SET      11.647      100.000
[...]
SET      12.543      100.000
SET      12.543      100.000
SET      12.543      100.000
[...]
SET      12.927      100.000
SET      12.927      100.000
---
GET       0.607        0.000
GET       2.431        5.000
GET       2.463       10.000
GET       2.495       15.000
GET       2.511       20.000
GET       2.527       25.000
GET       2.543       30.000
GET       2.559       35.000
GET       2.575       40.000
GET       2.591       45.000
GET       2.607       50.000
GET       2.607       52.500
GET       2.607       55.000
GET       2.623       57.500
GET       2.623       60.000
GET       2.639       62.500
GET       2.639       65.000
GET       2.655       67.500
GET       2.655       70.000
GET       2.671       72.500
GET       2.671       75.000
GET       2.671       76.250
GET       2.687       77.500
GET       2.687       78.750
GET       2.687       80.000
GET       2.703       81.250
GET       2.703       82.500
GET       2.703       83.750
GET       2.719       85.000
GET       2.719       86.250
GET       2.719       87.500
GET       2.735       88.125
GET       2.735       88.750
GET       2.735       89.375
GET       2.735       90.000
GET       2.751       90.625
GET       2.751       91.250
GET       2.751       91.875
GET       2.767       92.500
GET       2.767       93.125
GET       2.783       93.750
GET       2.783       94.062
GET       2.799       94.375
GET       2.799       94.688
GET       2.815       95.000
GET       2.815       95.312
GET       2.831       95.625
GET       2.863       95.938
GET       2.975       96.250
GET       3.455       96.562
GET       3.775       96.875
GET       4.799       97.031
GET       4.895       97.188
GET       4.959       97.344
GET       4.991       97.500
GET       5.023       97.656
GET       5.055       97.812
GET       5.087       97.969
GET       5.119       98.125
GET       5.151       98.281
GET       5.183       98.438
GET       5.183       98.516
GET       5.183       98.594
GET       5.215       98.672
GET       5.215       98.750
GET       5.247       98.828
GET       5.247       98.906
GET       5.247       98.984
GET       5.279       99.062
GET       5.279       99.141
GET       5.311       99.219
GET       5.311       99.258
GET       5.311       99.297
GET       5.311       99.336
GET       5.343       99.375
GET       5.343       99.414
GET       5.343       99.453
GET       5.375       99.492
GET       5.375       99.531
GET       5.375       99.570
GET       5.375       99.609
GET       5.407       99.629
GET       5.407       99.648
GET       5.407       99.668
GET       5.407       99.688
GET       5.407       99.707
GET       5.439       99.727
GET       5.439       99.746
GET       5.439       99.766
GET       5.439       99.785
GET       5.439       99.805
GET       5.439       99.814
GET       5.471       99.824
GET       5.471       99.834
GET       5.471       99.844
GET       5.471       99.854
GET       5.471       99.863
GET       5.471       99.873
GET       5.503       99.883
GET       5.503       99.893
GET       5.503       99.902
GET       5.503       99.907
GET       5.503       99.912
GET       5.503       99.917
GET       5.503       99.922
GET       5.503       99.927
GET       5.535       99.932
GET       5.535       99.937
GET       5.535       99.941
GET       5.535       99.946
GET       5.567       99.951
GET       5.567       99.954
GET       5.567       99.956
GET       5.567       99.958
GET       5.567       99.961
GET       5.567       99.963
GET       5.599       99.966
GET       5.599       99.968
GET       5.599       99.971
GET       5.599       99.973
GET       5.599       99.976
GET       5.599       99.977
GET       5.631       99.978
GET       5.631       99.979
GET       5.631       99.980
GET       5.631       99.982
GET       5.631       99.983
GET       5.631       99.984
GET       5.663       99.985
GET       5.663       99.987
GET       5.663       99.988
GET       5.695       99.988
GET       5.695       99.989
GET       5.695       99.990
GET       5.727       99.990
GET       5.759       99.991
GET       5.759       99.991
GET       6.079       99.992
GET       6.175       99.993
GET       6.175       99.993
GET       6.527       99.994
GET       6.623       99.994
GET       6.623       99.995
GET       6.623       99.995
GET       6.847       99.995
GET       6.847       99.995
GET       7.231       99.996
GET       7.231       99.996
GET       7.743       99.996
GET       7.743       99.997
GET       7.743       99.997
GET       8.255       99.997
GET       8.255       99.997
GET       8.255       99.997
GET       8.255       99.998
GET       8.255       99.998
GET       8.959       99.998
GET       8.959       99.998
GET       8.959       99.998
[...]
GET      10.943       99.999
GET      10.943       99.999
GET      10.943       99.999
[...]
GET      11.327       99.999
GET      11.327      100.000
---
WAIT      0.000      100.000